Revit 2026 API

# ShowHiddenLinesValues Enumeration

---

Provides options for display of hidden lines in a given view.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public enum ShowHiddenLinesValues
```
```vb
Public Enumeration ShowHiddenLinesValues
```
```cpp
public enum class ShowHiddenLinesValues
```
```fsharp
type ShowHiddenLinesValues
```

| Member name | Value | Description |
| --- | --- | --- |
| All | 2 | Show all hidden lines. |
| ByDiscipline | 1 | Show hidden lines according to discipline. |
| None | 0 | Do not show any hidden lines. |

#### Reference

Autodesk.Revit.DB Namespace